Repository: sslavik/acdat
Catalog: TMXParser/en-es.tmx
Source language: en
Languages: es

source: This example demonstrates that when assigning a reference to a static variable, it' s not remembered when you call the get_instance_ref() function a second time.
es: Function Test () {static $count = 0; $count++; echo $count; if ($count 10) {Test ();} $count--;}

source: Sometimes it is convenient to be able to have variable variable names.
es: A veces es conveniente tener nombres de variables variables.

source: That is, a variable name which can be set and used dynamically.
es: Dicho de otro modo, son nombres de variables que se pueden establecer y usar dinámicamente.

source: A normal variable is set with a statement such as:
es: Una variable normal se establece con una sentencia como:

source: ?php $a = "hello";?
es: $a = "hello";

source: A variable variable takes the value of a variable and treats that as the name of a variable.
es: Una variable variable toma el valor de una variable y lo trata como el nombre de una variable.

source: In the above example, hello, can be used as the name of a variable by using two dollar signs. i.e.
es: En el ejemplo anterior, hello, se puede usar como el nombre de una variable utilizando dos signos de dólar. p.ej.

source: ?php $$a = "world";?
es: $$a = "world";

source: Therefore, this statement:
es: En este momento se han definido y almacenado dos variables en el árbol de símbolos de PHP: $a, que contiene "hello", y $hello, que contiene "world".

source: ?php echo "$a ${$a}";?
es: Es más, esta sentencia:

source: produces the exact same output as:
es: echo "$a ${$a}";

source: i.e. they both produce: hello world.
es: produce el mismo resultado que:

source: In order to use variable variables with arrays, you have to resolve an ambiguity problem.
es: echo "$a $hello";

source: That is, if you write $$a[ 1] then the parser needs to know if you meant to use $a[1] as a variable, or if you wanted $$a as the variable and then the [1] index from that variable.
es: p.ej. ambas producen el resultado: hello world.

source: This means you cannot do things like ${$_GET}.
es: Si se escribe $$a[ 1] el intérprete necesita saber si nos referimos a utilizar $a[1] como una variable, o si se pretendía utilizar $$a como variable y el índice [1] como índice de dicha variable.

source: If you are looking for a way to handle availability of superglobals and the old HTTP_*_VARS, you might want to try referencing them.
es: La sintaxis para resolver esta ambiguedad es: ${$a[1]} para el primer caso y ${$a}[1] para el segundo.

source: Appendix B.
es: Apéndice B.

source: Example B-1.
es: Ejemplo B-1.

source: Migrating from PHP / FI 2 to PHP 3
es: Migrando de PHP / FI 2.0 a PHP 3.0

source: PHP 3.0 is rewritten from the ground up.
es: PHP 3.0 ha sido reescrito desde cero.

source: It has a proper parser that is much more robust and consistent than 2.0 's.
es: Tiene un intérprete propio, que es mucho mas robusto y consistente que el de 2.0.

source: 3.0 is also significantly faster, and uses less memory.
es: 3.0 es también significativamente mas rápido, y usa menos memoria.

source: However, some of these improvements have not been possible without compatibility changes, both in syntax and functionality.
es: De cualquier modo, algunas de estas mejoras no fueron posibles sin alterar la compatibilidad, tanto de sintaxis como de funcionamiento.

source: In addition, PHP' s developers have tried to clean up both PHP's syntax and semantics in version 3.0, and this has also caused some incompatibilities.
es: Además, los desarrolladores de PHP han intentado clarificar la sintaxis y la semántica de PHP 3.0, y eso ha causado también algunas incompatibilidades.

source: In the long run, we believe that these changes are for the better.
es: Creemos que, a la larga, estos cambios serán para mejor.

source: This chapter will try to guide you through the incompatibilities you might run into when going from PHP / FI 2.0 to PHP 3.0 and help you resolve them.
es: Este capítulo, intentará guiarle a través de las incompatibilidades que encontrará si migra de PHP / FI 2.0 a PHP 3.0, además de ayudarle a resolverlas.

source: New features are not mentioned here unless necessary.
es: No se mencionarán aquí las herramientas nuevas, hasta que sea necesario.

source: A conversion program that can automatically convert your old PHP / FI 2.0 scripts exists.
es: Existe un programa que convierte automáticamente sus viejos guiones PHP / FI 2.0.

source: This program only catches the syntax changes though, so you should read this chapter carefully anyway.
es: Puede hallarlo en el subdirectorio convertor de la distribucion 3.0 de PHP Este programa, solo actúa en referencia a los cambios sintácticos, así que debería leer este capítulo detenidamente, de todos modos.

source: Start / end tags
es: Tags de inicio y fin

source: The names in parentheses refer to internal PCRE names for these modifiers.
es: Modificadores de Patrones - - describe los modificadores posibles en los patrones de expresiones regulares (regex)

source: If this modifier is set, letters in the pattern match both upper and lower case letters.
es: Los nombres entre paréntesis se refieren a nombres internos PCRE para dichos modificadores.

source: By default, PCRE treats the subject string as consisting of a single "line" of characters (even if it actually contains several newlines).
es: Si es usado, no se distinguirá entre mayúsculas y minúsculas.

source: When this modifier is set, the "start of line" and "end of line "constructs match immediately following or immediately before any newline in the subject string, respectively, as well as at the very start and end.
es: Por defecto, PCRE trata la cadena de entrada como si fuera una sola línea de caracteres (aun cuando tenga varias).

source: If there are no "\n" characters in a subject string, or no occurrences of ^ or $in a pattern, setting this modifier has no effect.
es: Esto es lo mismo que en Perl.

source: Without it, newlines are excluded.
es: Cuando este modificador es utilizado, los constructores de "inicio de línea" y "fin de línea "son emparejados con el carácter de nueva línea.

source: This modifier is equivalent to Perl 's / s modifier.
es: Esto es equivalente al modificador / m del Perl.

source: A negative class such as [^a] always matches a newline character, independent of the setting of this modifier.
es: Si no hay caracteres "\n" en la cadena de entrada, o no existen ^ o $en el patrón, entonces este modificador no alterará el resultado.

source: If this modifier is set, whitespace data characters in the pattern are totally ignored except when escaped or inside a character class, and characters between an unescaped # outside a character class and the next newline character, inclusive, are also ignored.
es: Si se usa, el carácter especial de un punto en el patrón emparejará todos los caracteres, incluyendo el de nueva línea.

source: This is equivalent to Perl 's / x modifier, and makes it possible to include comments inside complicated patterns.
es: Sin él, el carácter de nueva línea es excluido.

source: Note, however, that this applies only to data characters.
es: Este modificador equivale a / s en Perl.

source: Whitespace characters may never appear within special character sequences in a pattern, for example within the sequence (? (which introduces a conditional subpattern.
es: Una cláusula como [^a] siempre casa con un carácter de nueva línea, independientemente de la utilización de este modificador.

source: If this modifier is set, preg_replace() does normal substitution of backreferences in the replacement string, evaluates it as PHP code, and uses the result for replacing the search string.
es: Los caracteres de espacio en blanco nunca pueden aparecer en la secuencia de caracteres especiales de un patrón, por ejemplo en la secuencia (? (la cual introduce un subpatrón condicional.

source: Only preg_replace() uses this modifier; it is ignored by other PCRE functions.
es: Si es usado, preg_replace() hace las sustituciones\\ de forma habitual, evalúa el código PHP y usa el resultado para realizar una sustitución en la cadena de búsqueda.

source: This modifier was not available in PHP3.
es: Sólo preg_replace() hace uso de este modificador y es ignorado por las otras funciones PCRE.

source: If this modifier is set, the pattern is forced to be "anchored", that is, it is constrained to match only at the start of the string which is being searched (the "subject string").
es: Nota:

source: This effect can also be achieved by appropriate constructs in the pattern itself, which is the only way to do it in Perl.
es: Este modificador fue añadido en PHP 4.0.

source: Without this modifier, a dollar also matches immediately before the final character if it is a newline (but not before any other newlines).
es: Si es definido, el patrón es forzado a ser "anclado", esto es, es obligado a emparejar sólo desde el inicio de la cadena (el "subject string").

source: There is no equivalent to this modifier in Perl.
es: Esta característica también puede realizarse con el apropiado patrón, y esta es la única manera de hacerlo en Perl.

source: If this modifier is set, then this extra analysis is performed.
es: Si es usado, el carácter del dólar en el patrón casará sólo con fin de la cadena de entrada (subject).Sin este modificador, un dólar es también emparejado con el carácter inmediatamente antes del de una nueva línea (pero no antes de cualquier otra nueva línea).

source: At present, studying a pattern is useful only for non-anchored patterns that do not have a single fixed starting character.
es: No hay equivalente en Perl para este modificador.

source: This modifier inverts the "greediness" of the quantifiers so that they are not greedy by default, but become greedy if followed by "?".
es: Cuando un patrón va a ser usado varias veces, es mejor dedicar más tiempo a analizarlo para acelerar el proceso de casamientos.

source: It is not compatible with Perl.
es: Si es definido entonces se realizar un análisis adicional.

source: It can also be set by a (?U) modifier setting within the pattern.
es: Estudiar a un patrón es sólo útil para los no anclados, esto es, no tienen un carácter de inicio fijado.

source: Any backslash in a pattern that is followed by a letter that has no special meaning causes an error, thus reserving these combinations for future expansion.
es: Este modificador invierte la "codicia" de los cuantificadores aunque no son ansiosos por defecto, se vuelven codiciosos si son seguidos por un "?".

source: There are at present no other features controlled by this modifier.
es: No es compatible con Perl. también puede usarse dentro del patrón.

source: Pattern strings are treated as UTF-8.
es: Cualquier barra invertida en el patrón que sea seguida por una letra que no tenga una interpretación especial provocará un error, estas combinaciones están reservado para futuras ampliaciones.

source: This modifier is available from PHP 4.1.0 or greater on Unix and from PHP 4.2.3 on win32.
es: No hay otras características controladas por este modificador a la fecha de hoy.

source: The current implementation corresponds to Perl 5.005.
es: La librería PCRE es un conjunto de funciones que implementan emparejamientos dados patrones de expresiones regulares usando la misma sintaxis y semántica queLa librería PCRE es un conjunto de funciones que implementan emparejamientos dados patrones de expresiones regulares usando la misma sintaxis y semántica que Perl 5, con unas pocas diferencias (ver más adelante).

source: The differences described here are with respect to Perl 5.005.
es: Las diferencias descritas aquí son con respecto a Perl 5.005.

source: Normally isspace() matches space, formfeed, newline, carriage return, horizontal tab, and vertical tab.
es: Por defecto, un carácter de espacio en blanco es cualquier carácter que la función isspace() de la librería C reconozca, así es posiblePor defecto, un carácter de espacio en blanco es cualquier carácter que la función isspace() de la librería C reconozca, así es posible compilar PCRE con tablas alternativas de tipos de caracteres.

source: The \v escape that was in the Perl documentation for a long time was never in fact recognized.
es: Normalmente isspace() casa con el espacio, salto de pagina, nueva línea, retorno de carro,Normalmente isspace() casa con el espacio, salto de pagina, nueva línea, retorno de carro, tabulador horizontal y vertical.

source: In 5.004 and 5.005 it does not match \s.
es: Perl 5 ya no incluye el tabulador verticalPerl 5 ya no incluye el tabulador vertical en su conjunto de caracteres de espacio en blanco.

source: Perl permits them, but they do not mean what you might think.
es: La secuencia de escape \n que estuvo durante mucho tiempo en la documentación de Perl nuncaLa secuencia de escape \n que estuvo durante mucho tiempo en la documentación de Perl nunca fue reconocida.

source: It just asserts that the next character is not "a" three times.
es: Sin embargo, el carácter fue tratado como espacio en blancoSin embargo, el carácter fue tratado como espacio en blanco hasta la 5.002.

source: Capturing subpatterns that occur inside negative looka - head assertions are counted, but their entries in the offsets vector are never set.
es: En 5.004 y 5.005 no casa \s.

source: Perl sets its numerical vari - ables from any such patterns that are matched before the assertion fails to match something (thereby succeeding), but only if the negative lookahead assertion contains just one branch.
es: Perl las permite, pero no de la forma que puedas pensar.

source: Though binary zero characters are supported in the subject string, they are not allowed in a pattern string because it is passed as a normal C string, terminated by zero.
es: Por ejemplo, (?!a){3} no dice que los próximos tres caracteres no son "a ".

source: In fact these are implemented by Perl 's general string-handling and are not part of its pat - tern matching engine.
es: Los subpatrones encontrados dentro de sentencias de más adelante negativas son contados, pero sus entradas en el vector de desplazamientosLos subpatrones encontrados dentro de sentencias de más adelante negativas son contados, pero sus entradas en el vector de desplazamientos no son definidas.

source: Fairly obviously, PCRE does not support the (?{code}) construction.
es: Perl define sus variables numéricas desde cualquiera de tales patrones que son casados antes de que la sentencia falle emparejar algo, pero solo si las sentencies de más adelante negativas contienen una opción sola.

source: For example, matching "aba" against the pattern / ^(a(b) ?)+$ / sets $2 to the value "b", but matching "aabbaa "against / ^(aa(bb)? )+$ / leaves $2 unset.
es: Aunque los caracteres de cero binario son soportados en la cadena de entrada, no son permitidos en un patrón porque son pasados como un cadenaAunque los caracteres de cero binario son soportados en la cadena de entrada, no son permitidos en un patrón porque son pasados como un cadena típica de C, terminada por cero.

source: However, if the pattern is changed to / ^( aa(b(b)) ?)+$ / then $2 (and $3) get set.
es: La secuencia de escape "\0" puede ser usada en el patrón para representar el cero binario.

source: If in the future Perl changes to a consistent state that is different, PCRE may change to follow.
es: Las siguientes secuencias de Perl no son soportadas:Las siguientes secuencias de Perl no son soportadas: \l, \u, \L, \U, \E, \Q.

source: Another as yet unresolved discrepancy is that in Perl 5.005_02 the pattern / ^( a) ?(?(1)a_BAR_b)+$ / matches the string "a ", whereas in PCRE it does not.
es: En efecto, estas son implementadas por manipuladores de cadenas típicos de Perl y no son parte de los patrones del motor de búsqueda.

source: PCRE provides some extensions to the Perl regular expression facilities:
es: La secuencia \G de Perl no es soportada ya que no es relevante para emparejamientos de patrones sencillos.

source: Although lookbehind assertions must match fixed length strings, each alternative branch of a lookbehind assertion can match a different length of string.
es: Obviamente, PCRE no soporta el constructor (?{code})Obviamente, PCRE no soporta el constructor (?{code}) 8.

source: If PCRE_DOLLAR_ENDONLY is set and PCRE_MULTILINE is not set, the $meta - character matches only at the very end of the string.
es: Hay algunas diferencias en Perl 5.005_02 respecto a las definicionesHay algunas diferencias en Perl 5.005_02 respecto a las definiciones de las cadenas de captura cuando parte de un patrón es repetido.

source: If PCRE_UNGREEDY is set, the greediness of the repeti - tion quantifiers is inverted, that is, by default they are not greedy, but if followed by a question mark they are.
es: Por ejemplo, casando "aba" con el patrón / ^(a(b) ?)+$ / define $2 al valor "b",Por ejemplo, casando "aba "con el patrón / ^(a(b) ?)+$ / define $2 al valor "b", pero emparejando "aabbaa" con / ^(aa(bb)? )+$ / deja $2 sin definir.

source: The syntax and semantics of the regular expressions sup - ported by PCRE are described below.
es: Sin embargo, si el patrón es cambiado a / ^( aa(b(b)) ?)+$ / entones $2 (y $3) son definidos.

source: Regular expressions are also described in the Perl documentation and in a number of other books, some of which have copious examples.
es: En Perl 5.004 $2 es definido en ambos casos, y también es cierto en PCRE.

source: A regular expression is a pattern that is matched against a subject string from left to right.
es: Otra discrepancia aún no resuelta es que en Perl 5.005_02 el patrónOtra discrepancia aún no resuelta es que en Perl 5.005_02 el patrón / ^( a) ?(?(1)a_BAR_b)+$ / casa la cadena "a ", pero en PCRE eso no es así.

source: As a trivial example, the pattern The quick brown fox matches a portion of a subject string that is identical to itself.
es: Perl 5.005 requiere que todas ellas tengan la misma longitud. (b) Si es definido PCRE_DOLLAR_ENDONLY y PCRE_MULTILINE no lo es, el carácter especial $sólo casa con el final de la cadena. (c) Si se define PCRE_EXTRA, una barra invertida seguida de una letra sin un significado especial provoca un error. (d) Si defines PCRE_UNGREEDY, la voracidad de los cuantificadores de repetición es invertida, esto es, por defecto son no codiciosos, pero seguidos por una interrogación si lo son.

source: The power of regular expressions comes from the ability to include alternatives and repetitions in the pat - tern.
es: La sintaxis y la semántica de las expresiones soportadas por PCRE esLa sintaxis y la semántica de las expresiones soportadas por PCRE es descrita a continuación.

source: There are two different sets of meta-characters: those that are recognized anywhere in the pattern except within square brackets, and those that are recognized in square brackets.
es: Las expresiones son descritas en la documentación del Perl y en numerosos libros, algunos de los cuales tienen mucho ejemplares, Jeffrey Friedl' s "Mastering Regular Expressions", publicadoLas expresiones son descritas en la documentación del Perl y en numerosos libros, algunos de los cuales tienen mucho ejemplares, Jeffrey Friedl's "Mastering Regular Expressions", publicado por O'Reilly (ISBN 1-56592-257-3), las cubre con gran detalle.

source: general escape character with several uses
es: La presente descripción es propuesta como documentación de referencia.

source: assert end of subject (or line, in multiline mode)
es: Una expresión es un patrón que es emparejada repetidamente, dada una cadenaUna expresión es un patrón que es emparejada repetidamente, dada una cadena de entrada, de izquierda a derecha.

source: start character class definition
es: Muchos caracteres se representan a ellosMuchos caracteres se representan a ellos mismos en el patrón.

source: start of alternative branch
es: Como un ejemplo trivial, el patrón The quick brown foxComo un ejemplo trivial, el patrón The quick brown fox casa una parte de una cadena de entrada que es idéntica a ella.

source: end subpattern
es: El poder de las expresiones proviene de la posibilidad de incluir alternativas yEl poder de las expresiones proviene de la posibilidad de incluir alternativas y repeticiones en el patrón.

source: 0 or more quantifier
es: Éstos son codificados en el patrón usando meta - characters (caracteres especiales también llamados meta caracteres), los cuales no se representan a ellos mismos, en vez de eso, son interpretados de una manera especial.

source: start min / max quantifier
es: Fuera de los corchetes, los caracteres especiales son:\ carácter de escape genérico con diferentes usos ^ secuencia de inicio de la cadena de entrada (o línea, en modo multilínea) $secuencia de fin de la cadena de entrada (o línea, en modo multilínea). empareja cualquier carácter excepto el de nueva línea (por defecto) [inicia definición de clase de caracteres _BAR_ inicio de opción alternativa (inicio de subpatrón) fin de subpatrón? amplia el significado de (también es el cuantificador 0 ó 1 también es el cuantificador minimizado * cero o más cuantificadores + uno o más cuantificadores {inicia el cuantificador min / max Parte de un patrón dentro de corchetes ([]) es llamado un "character class"Fuera de los corchetes, los caracteres especiales son:\ carácter de escape genérico con diferentes usos ^ secuencia de inicio de la cadena de entrada (o línea, en modo multilínea) $secuencia de fin de la cadena de entrada (o línea, en modo multilínea). empareja cualquier carácter excepto el de nueva línea (por defecto) [inicia definición de clase de caracteres _BAR_ inicio de opción alternativa (inicio de subpatrón) fin de subpatrón? amplia el significado de (también es el cuantificador 0 ó 1 también es el cuantificador minimizado * cero o más cuantificadores + uno o más cuantificadores {inicia el cuantificador min / max Parte de un patrón dentro de corchetes ([]) es llamado un "character class "(clase de caracteres).

source: general escape character
es: En una clase de caracteres los únicos caracteres especiales son:\ carácter de escape genérico ^ niega la clase, pero sólo si el primer carácter - indica un rango de caracteres] finaliza la clase de caracteres Las secciones siguientes describen el uso de cada uno de los caracteres especiales (meta caracteres).

source: indicates character range
es: BARRA INVERTIDABARRA INVERTIDA El carácter de barra invertida tiene varios usos.

source: The backslash character has several uses.
es: Primero, si es seguido por un carácter que no sea alfanumérico, toma el significado que elPrimero, si es seguido por un carácter que no sea alfanumérico, toma el significado que el carácter pueda tener.

source: Firstly, if it is followed by a non-alphanumeric character, it takes away any special meaning that character may have.
es: Este uso de la barra invertida, como un carácter de escape, se aplica tanto dentro como fuera de las clases de caracteres.

source: This use of backslash as an escape character applies both inside and outside character classes.
es: Por ejemplo, si quieres casar un carácter "*", debes escribir "\*" en el patrón.

source: This applies whether or not the follow - ing character would otherwise be interpreted as a meta - character, so it is always safe to precede a non-alphanumeric with "\" to specify that it stands for itself.
es: Esto es aplicable ya sea o no el carácter siguiente interpretado como un carácter especial, por eso siempre es aconsejable preceder un carácterEsto es aplicable ya sea o no el carácter siguiente interpretado como un carácter especial, por eso siempre es aconsejable preceder un carácter no alfanumérico con "\" para especificar que se representa a él mismo.

source: In particu - lar, if you want to match a backslash, you write "\\".
es: En particular, si quieres casar una barra invertida, escribe "\\".
